import pytest
import pandas as pd

@pytest.fixture
def data_transactions():
    return [
    {'Дата операции': '2024-02-13', 'Сумма операции': 765.00},
    {'Дата операции': '2024-02-02', 'Сумма операции': 1105.50},
    {'Дата операции': '2024-06-07', 'Сумма операции': 220.30},
    {'Дата операции': '2024-06-19', 'Сумма операции': 118.12},
    {'Дата операции': '2024-06-29', 'Сумма операции': 350.00},
    {'Дата операции': '2024-07-06', 'Сумма операции': 'asd'},
    {'Дата операции': '2024-07-16', 'Сумма операции': 'qwer'}
]

@pytest.fixture
def call_dataframe():
    return pd.DataFrame(
        {'Категория': ['Супермаркеты', 'Супермаркеты', 'Супермаркеты', 'Каршеринг', 'Каршеринг',
                       'Супермаркеты', 'Супермаркеты',],
        'Дата операции': ['2024-07-16', '2024-06-29', '2024-06-26', '2024-02-13',
                            '2024-05-11', '2024-05-19', '2024-04-02'],
        'Сумма платежа': [112.00, 324.50, 1120.20, 318.25, 1005.10, 2050.75, 700.00]}
    )
