import pytest


@pytest.fixture
def data_transactions():
    return [
    {'Дата операции': '2024-02-13', 'Сумма операции': 765.00},
    {'Дата операции': '2024-02-02', 'Сумма операции': 1105.50},
    {'Дата операции': '2024-06-07', 'Сумма операции': 220.30},
    {'Дата операции': '2024-06-19', 'Сумма операции': 118.12},
    {'Дата операции': '2024-06-29', 'Сумма операции': 350.00},
    {'Дата операции': '2024-07-06', 'Сумма операции': 'asd'},
    {'Дата операции': '2024-07-16', 'Сумма операции': 'qwer'}
]